[
  {
    "projectType": "website",
    "title": "Wandering Ponderer",
    "year": 2019,
    "linkName": "/projects/wandering-ponderer",
    "imageURL": "A young man looking out from a forest into the flowing green expanse of a Thai island",
    "description": "A personal travel site for an explorer, writer, and overthinker.",
    "caseDescription": "I wanted to create a site that could serve as a base for all my travel ramblings. It needed to be coded by hand as a way of practically applying the fundamental front-end concepts I was learning at the time. Visually, pages needed to be centered around keeping things aesthetically minimal and non-distracting. This gavegive the viewer some breathing space to peruse the content at a convenient pace.",
    "secondDescription": "Large full-width images and flowing prose characterises the dreamy manner in which I captured and wrote this content. Legibility was key here with the heavy emphasis on the written word. Ultimately, this was an exercise in piecing together my, at the time, maturing HTML, CSS, and JavaScript skills. Ultimately, I got caught up in the exhiliration that is creating something personal from scratch.",
    "secondDescriptionQuote": "Large Images and Flowing Prose...",
    "skillsUtilized": [
      {
        "name": "Design",
        "description": "AdobeXD was the UI/UIX tool of choice here. This early project allowed me to become really comfortable working with this vector-based design solution."
      },
      {
        "name": "Web Performance",
        "description": "Vanilla HTML, CSS, and JavaScript meant the site had no built-in performance-enhancements. Web best practices were studied and applied allowing for a fast, lightweight site."
      },
      {
        "name": "Open-Source",
        "description": "The entire project was pushed (and hosted) on Github from it's conception. I became comfortable with a Git-based workflow as a result."
      }
    ],
    "techStack": [
      {
        "name": "JavaScript",
        "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
      },
      {
        "name": "HTML",
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML"
      },
      { "name": "SASS", "url": "https://sass-lang.com/" }
    ],
    "toolSet": [
      {
        "name": "AdobeXD",
        "url": "https://www.adobe.com/africa/products/xd.html"
      },
      { "name": "VSCode", "url": "https://code.visualstudio.com/" },
      { "name": "Git", "url": "https://git-scm.com/" },
      { "name": "Github", "url": "https://github.com/" }
    ],
    "siteURL": null,
    "codeURL": "https://github.com/Rey810/rey810.github.io",
    "image": "images/wp-palm_trees.png",
    "images": [
      {
        "src": "images/wp-home.png",
        "long": true
      },
      {
        "src": "images/wp-all_places__browser.png",
        "long": false
      },
      {
        "src": "images/wp-article.png",
        "long": true
      }
    ]
  },
  {
    "projectType": "website",
    "title": "Deep Roots",
    "year": 2020,
    "linkName": "/projects/deep-roots",
    "imageURL": "Deep Roots landing page with a band rocking in the background.",
    "description": "The official site for the much-loved Deep Roots Night Market",
    "caseDescription": "Deep Roots had already established a reputation as the best Friday night market in Pretoria. They were, however, without a business website that brought across their professional yet down-to-earth, lovable vibe that they are known for.",
    "collab": [
      {
        "name": "Toasted Marshmallow",
        "link": "https://toastedmarshmallow.co/",
        "icon": "images/TM-logo.png"
      }
    ],
    "secondDescription": "A clean, minimal design with a dark aesthetic stays true to the professional offering Deep Roots provides its vendors and customers. Deep Roots is known for it's on-the-ground interaction and fantastic people-skills. As such, website wording (copy) that captures their kind, relatable nature is essential for a site that accentuates Deep Roots' personality. The end-product is a site where visitors can find all the key info about the next market, book an event planning session with Deep Roots, and get a real feel for the Deep Roots everyone loves.",
    "secondDescriptionQuote": "Accentuating the Deep Roots personality",
    "skillsUtilized": [
      {
        "name": "CMS",
        "description": "A user-friendly content management system was set up to make it easy for Deep Roots to be in control of the key Night Market info like ticket price and performing artists."
      },
      {
        "name": "Visitor Focused",
        "description": "Most people would be accessing the site on mobile. This prioritized a mobile-friendly design and development approach to maximise a site visitors experience with fast load times, a spacious UI, and a thoughtful UX."
      },
      {
        "name": "Speed Optimization",
        "description": "Site speed is integral to a happy user-experience. As such, the development was done with speed optimizations at the forefront of decision-making with practices such as crucial page pre-fetching, image optimizations, clean JavaScript code, and semantic HTML."
      }
    ],
    "techStack": [
      {
        "name": "JavaScript",
        "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
      },
      {
        "name": "HTML",
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML"
      },
      {
        "name": "CSS",
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS"
      }
    ],
    "toolSet": [
      {
        "name": "Webflow",
        "url": "https://webflow.com/"
      },
      {
        "name": "AdobeXD",
        "url": "https://www.adobe.com/africa/products/xd.html"
      }
    ],
    "siteURL": "https://deep-roots.webflow.io/",
    "codeURL": null,
    "image": "images/Deep-Roots-Landing-Mobile.png",
    "images": [
      {
        "src": "images/Deep-Roots-Land.png",
        "long": true
      },
      {
        "src": "images/Deep-Roots-Night-Market.png",
        "long": true
      },
      {
        "src": "images/Deep-Roots-Event-Planning.png",
        "long": true
      },
      {
        "src": "images/Deep-Roots-Contact.png",
        "long": true
      }
    ]
  },
  {
    "projectType": "app",
    "title": "Odin's Forecast",
    "year": 2020,
    "linkName": "/projects/odins-forecast",
    "imageURL": "The results of a weather search on the 'Odin's Forecast' weather app",
    "description": "A minimalist weather app built to deliver the most important info. Clean code, clean design and clean results.",
    "caseDescription": "A weather app built to deliver only the most important weather information. This was built using vanilla JS. Everything else was also coded by hand. The results? It can run in any browser, works on mobile and desktop while using ES6 JS syntax for beautiful code that's easily understood by other developers.",
    "secondDescription": "Two APIs (Flickr and OpenWeatherMap) are used in conjunction with Cloudfare service workers setup to secure my API keys. The result is that no sensitive information is exposed in the response. An image of the queried location is returned from Flickr's API. The response is filtered on the service worker side with a dynamic query so that only 5 relevant images are returned. I then randomly selected one of the returned images to serve as the image displayed to the user to keep things interesting. The Algolia API was used to implement an auto-complete search feature assisting users in finding the name of a city they can't quite remember correctly.",
    "secondDescriptionQuote": "Secure API calls, fast UI updates, city auto-complete",
    "skillsUtilized": [
      {
        "name": "Mobile-First",
        "description": "The entire design was built with mobile-users in mind. This mindset elucidated the most important UI elements required for a complete experience. As a result, the final UI is lean and minimalistic."
      },
      {
        "name": "API Consumption",
        "description": "Three different APIs were called using JavaScript's Fetch. Responses were trimmed and tailored according to what I needed displayed. Response errors are handled and default values are used as fallbacks."
      },
      {
        "name": "Security",
        "description": "Cloudfare's service workers were setup and then called from within my JavaScript code. This added an extra security layer to keep my API keys hidden and thus keep my API accounts secure."
      }
    ],
    "techStack": [
      {
        "name": "JavaScript",
        "url": "https://developer.mozilla.org/en-US/docs/Web/JavaScript"
      },
      { "name": "SASS", "url": "https://sass-lang.com/" },
      {
        "name": "HTML",
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML"
      }
    ],
    "toolSet": [
      {
        "name": "AdobeXD",
        "url": "https://www.adobe.com/africa/products/xd.html"
      },
      { "name": "VSCode", "url": "https://code.visualstudio.com/" },
      { "name": "Git", "url": "https://git-scm.com/" },
      { "name": "Github", "url": "https://github.com/" },
      { "name": "Cloudfare", "url": "https://www.cloudflare.com/" }
    ],
    "siteURL": "https://rey810.github.io/Weather-App/",
    "codeURL": "https://github.com/Rey810/Weather-App",
    "image": "images/odins_forecast__half-phone.png",
    "images": [
      { "src": "images/odins_forecast-1.png", "long": false },
      { "src": "images/odins_forecast.png", "long": false },
      { "src": "images/odins_forecast-2.png", "long": false },
      { "src": "images/odins_forecast-4.png", "long": false },
      { "src": "images/odins_forecast-5.png", "long": false },
      { "src": "images/odins_forecast-3.png", "long": false },
      { "src": "images/odins_forecast__full-phone.png", "long": false }
    ]
  },
  {
    "projectType": "app",
    "title": "Root",
    "year": 2020,
    "linkName": "/projects/root",
    "imageURL": "Home page of the Root design",
    "description": "A Proof-of-Concept dashboard design for a South African fitness app.",
    "caseDescription": "Vertical rhythm and clever use of whitespace with a focus on functionality resulted in this Proof-of-Concept design for the initial stages of a fitness app's development stage. ",
    "secondDescription": "Function over form was prioritized without sacrificing fundamental design principles and respect for usability. The most important code here is clearly the CSS which is well annotated and written in a consistent, predictable manner allowing for easier collaboration with fellow developers. Clean, semantic HTML compliments a practical design which does it's part in making the web more accessible.",
    "secondDescriptionQuote": "Functional and Accessible",
    "skillsUtilized": [
      {
        "name": "Vertical Rhythm",
        "description": "Consistent spacing is key to achieving a harmonius design. Here I used a vertical rhythm based on a 8pt 'beat'. As a result, the spacing design was implemented quickly and predictably."
      },
      {
        "name": "Layout",
        "description": "A map, graph, and controller modal all on one screen could have been quite cramped. But a clever use of space and visual hierarchy meant all of the elements fit in one viewport without sacrificing an aesthetically pleasing result."
      },
      {
        "name": "Accessibility",
        "description": "This is an absolute requirement in any project I build. Here I achieved a UI that would be accessible by all users regardless of visual acuity by focusing on larger interaction areas, a clear hierarchy with variable font-weights and white space, semantic HTML, and strong colour contrasts."
      }
    ],
    "techStack": [
      {
        "name": "HTML",
        "url": "https://developer.mozilla.org/en-US/docs/Web/HTML"
      },
      {
        "name": "CSS",
        "url": "https://developer.mozilla.org/en-US/docs/Web/CSS"
      }
    ],
    "toolSet": [
      { "name": "AdobeXD", "url": "/" },
      { "name": "VSCode", "url": "/" },
      { "name": "Git", "url": "/" },
      { "name": "Github", "url": "https://github.com/" }
    ],
    "siteURL": null,
    "codeURL": "https://github.com/Rey810/Root",
    "image": "images/root.png",
    "images": [
      {
        "srcSet": [
          {
            "mobile": {
              "src": "images/root__long-browser-MOBILE.png"
            },
            "desktop": {
              "src": "images/root__long-browser.png"
            }
          }
        ],
        "fullWidthLongScroll": true
      }
    ]
  },
  {
    "projectType": "app",
    "title": "Dan's Meditation",
    "year": 2020,
    "linkName": "/projects/dannys-meditation-app",
    "imageURL": "Danny's Meditation App home page",
    "description": "A re-design of a fellow front-end developer's meditation app.",
    "caseDescription": "Danny was in the process of building a meditation app for the Google Play Store. I offered my help with the design. The result was a more visually consistent design rooted in strong vertical rhythm, sizing, and colour principles to deliver a calmer, focused experience for meditators.",
    "secondDescription": "Image choice was largely guided by how we, as meditators, want to perceive our practices: Non-distracted, tranquil, at peace. This meant larger, beautiful images of fellow meditators to serve as inspiration and a source of grounding. Colour is crucial to our digital expereinces. Seeing as experience is the whole crux of this app, I took Danny's initial brand colour and constructed complementary auxillary colours with lightness and saturation variations to give the rest of the app a more consistent aesthetic.",
    "secondDescriptionQuote": "Non-distracted, tranquil, and completely at peace...",
    "skillsUtilized": [
      {
        "name": "Vertical Rhythm",
        "description": "Consistent spacing is key to achieving a harmonius design. Here I used a vertical rhythm based on a 8pt 'beat'. As a result, the spacing design was implemented predictably and harmoniously."
      },
      {
        "name": "Tranquil Design",
        "description": "Users of this app are here for one thing - cultivating a calmer, less reactive mind. Every color and element choice reflects an overall design decision that is non-distracting. The UI is spacious with clear CTAs cultivating a peaceful experience."
      },
      {
        "name": "Fast Iteration",
        "description": "Iteration is crucial to improvement. The initial design was handed over to me by Danny and I set to work. After a couple of hours, I had gone through tweaking iterations culminating in an improved design handed back to Danny in a super timely manner much to his happy surprise."
      }
    ],
    "techStack": [
      {
        "name": "A good Spotify playlist",
        "url": "https://open.spotify.com/playlist/37i9dQZF1DX8jnAPF7Iiqp?si=0vdM7aovSlSzeSTkhpb9eg"
      }
    ],
    "toolSet": [{ "name": "AdobeXD", "url": "/" }],
    "siteURL": null,
    "codeURL": null,
    "image": "images/meditation.jpg",
    "images": [
      {
        "srcSet": [
          {
            "mobile": {
              "src": "images/meditation__long-browser-MOBILE.png"
            },
            "desktop": {
              "src": "images/meditation__long-browser.png"
            }
          }
        ],
        "fullWidthLongScroll": true
      }
    ]
  },
  {
    "projectType": "app",
    "title": "Battleships",
    "year": 2020,
    "linkName": "/projects/battleships",
    "imageURL": "Battleships screen after a user has beaten the computer",
    "description": "The classic childhood game reimagined as a modern browser-based game built using the latest front-end web technologies.",
    "caseDescription": "The classic childhood game reimagined as a modern web application built using the latest front-end web technologies. Users battle against the computer in this turn-based game playable on your desktop or mobile browsers.",
    "secondDescription": "A React application full of beautiful unit tests, Object-Oriented programming design principles, and the best parts of JS functional programming. Ships were built with factory functions and then initialized inside two Board components to keep all logic inside a predictable scope. State was kept quite shallow (2 levels) to reduce state-management complexity. Overall, I'm really happy with the naming convention and folder structure proven by the ease of refactoring I experienced.",
    "secondDescriptionQuote": "Beautiful unit tests compliment the readable structure",
    "skillsUtilized": [
      {
        "name": "State Management",
        "description": "React's state object is used to control the game logic and user data. Components were built to be class-based. State is kept relatively shallow and no outside API calls are made thereby negating the need for more complex state management tools such as Redux."
      },
      {
        "name": "Test Driven Development",
        "description": "This approach allowed me to move consistently through my coding steps confident in the robustness of the application. I used React Testing Library to write unit tests for each React component. This allowed for predictable code and faster iteration even with the initial time spent on setting up tests."
      },
      {
        "name": "Continuous Deployment",
        "description": "Netlify was hooked up with Github allowing for rapid deployment on Netlfy's servers every time I pushed new code up to the apps's repository. This allowed for hotfixes pushed to Github to reflect almost instantaneously in the production environment."
      }
    ],
    "techStack": [
      { "name": "React", "url": "https://reactjs.org/" },
      { "name": "Jest", "url": "https://jestjs.io/" }
    ],
    "toolSet": [
      { "name": "AdobeXD", "url": "/" },
      { "name": "VSCode", "url": "/" },
      { "name": "Git", "url": "/" },
      { "name": "Github", "url": "https://github.com/" },
      { "name": "Netlify", "url": "https://www.netlify.com/" }
    ],
    "siteURL": "https://react-battleship-reythedev.netlify.app/",
    "codeURL": "https://github.com/Rey810/Battleship/tree/master/battleship",
    "image": "images/battleships.png",
    "images": [{ "src": "images/battleships__laptop.png", "long": false }]
  },
  {
    "projectType": "app",
    "title": "Eventor",
    "year": 2018,
    "linkName": "/projects/eventor",
    "imageURL": "Eventor's landing page",
    "description": "A web app for event creation and user signup management",
    "caseDescription": "The aim was to build a web app similar to Eventbrite in functionality. Users can sign up, create events, invite other users, and manage attendees of their events.",
    "secondDescription": "As part of my education in web development from The Odin Project, building this Rails app was a way to really nail Rails Active Record associations and the resultant data modelling needed to build the correct database schema.",
    "secondDescriptionQuote": "Database Scheming and Data Modelling",
    "skillsUtilized": [
      {
        "name": "Converting Design",
        "description": "The aesthetic was built purely to convert new visitors to users of the app. Visual techniques and knowledge of typical user behaviour were used to guide a visitor to the Call To Action as clearly and quickly as possible. "
      },
      {
        "name": "Data Architecture",
        "description": "The correct data modelling is crucial when building a database. In this case, my data architecture encompassed 'Eventhubs', 'Events', and 'Users' using various types of Active Record associations. The result was an application where a user can create events, have many people attend his/her events, and attend events him/herself."
      },
      {
        "name": "MVC Design Pattern",
        "description": "Ruby-on-Rails was used to implement a model-view-controller pattern which, in the case of this app, governs session creation, events creation and the display of all other relevant information."
      }
    ],
    "techStack": [
      { "name": "Ruby", "url": "https://www.ruby-lang.org/en/" },
      { "name": "Ruby-on-Rails", "url": "https://rubyonrails.org/" }
    ],
    "toolSet": [
      { "name": "AdobeXD", "url": "/" },
      { "name": "VSCode", "url": "/" },
      { "name": "Git", "url": "/" },
      { "name": "Github", "url": "https://github.com/" },
      { "name": "Heroku", "url": "https://www.heroku.com/" }
    ],
    "siteURL": null,
    "codeURL": "https://github.com/Rey810/private-events",
    "image": "images/eventor.png",
    "images": [
      { "src": "images/eventor__monitor.png", "long": false },
      { "src": "images/eventor__browser.png", "long": false }
    ]
  }
]
